package lesson03;

/*
* Задача 3
* Вывести все цифры в обратном порядке на экран с использованием цикла for
* */
public class Class07 {
    public static void main(String[] args) {
        for (int i = 11; i > 4; i--) {
            System.out.print(i + " ");
        }
    }
}